[
  {
    "id": 1,
    "title": "Hollow Knight",
    "coverPhoto": "https://i.ibb.co.com/KjGM8c8d/4643fb058642335c523910f3a7910575f56372f612f7c0c9a497aaae978d3e51-1024x576.jpg",
    "category": "Action-Adventure",
    "downloadLink": "https://store.steampowered.com/app/367520/Hollow_Knight/",
    "description": "Descend into the haunting world of Hallownest, a ruined kingdom teeming with secrets, danger, and beauty. Hollow Knight offers fluid combat, intricate platforming, and a vast interconnected map filled with challenging enemies and hidden lore. As a mysterious silent knight, you’ll uncover ancient truths, battle grotesque creatures, and unlock powerful abilities. The game’s hand-drawn art, atmospheric soundtrack, and deep exploration mechanics create a mesmerizing experience that rewards curiosity and perseverance. Whether you're fighting epic bosses or discovering forgotten paths, Hollow Knight delivers a masterclass in action-adventure design with emotional depth and unforgettable ambiance.",
    "ratings": 9.4,
    "developer": "Team Cherry"
  },
  {
    "id": 2,
    "title": "Dead Cells",
    "coverPhoto": "https://i.ibb.co.com/3tFbMdB/dead-cells-switch-hero.jpg",
    "category": "Metroidvania",
    "downloadLink": "https://store.steampowered.com/app/588650/Dead_Cells/",
    "description": "Dead Cells is a fast-paced roguelike action-platformer that blends procedurally generated levels with intense combat and deep customization. You play as a reanimated corpse exploring a shifting castle, battling enemies with swords, bows, magic, and bizarre weapons. Each run offers new challenges, upgrades, and secrets, encouraging experimentation and mastery. The game’s fluid movement, responsive controls, and punishing difficulty make every encounter thrilling. With unlockable paths, mutations, and a variety of builds, Dead Cells rewards skill and adaptability. Its pixel art style and dynamic soundtrack add flair to a brutal, addictive gameplay loop that keeps players coming back for more.",
    "ratings": 9.1,
    "developer": "Motion Twin"
  },
  {
    "id": 3,
    "title": "Katana ZERO",
    "coverPhoto": "https://i.ibb.co.com/qM0Jpkjz/katana-zero-f8dgrxw2948ay8jn.jpg",
    "category": "Action",
    "downloadLink": "https://store.steampowered.com/app/460950/Katana_ZERO/",
    "description": "Katana ZERO is a stylish neo-noir action platformer where every move counts. You play as a katana-wielding assassin navigating a world of violence, mystery, and psychological tension. Combat is fast, lethal, and precise—one hit kills, and time manipulation lets you dodge bullets and plan your attacks. The game’s narrative unfolds through cryptic dialogue, therapy sessions, and fragmented memories, creating a gripping story that blurs reality. With retro visuals, a pulsating synth soundtrack, and cinematic presentation, Katana ZERO delivers a visceral experience that’s as emotionally compelling as it is mechanically sharp. Every level is a puzzle of speed and strategy.",
    "ratings": 8.9,
    "developer": "Askiisoft"
  },
  {
    "id": 4,
    "title": "Cuphead",
    "coverPhoto": "https://i.ibb.co.com/84tNRXg5/cuphead-poster-in-yellow-m5xzoa08880poctv.jpg",
    "category": "Action",
    "downloadLink": "https://store.steampowered.com/app/268910/Cuphead/",
    "description": "Cuphead is a visually stunning run-and-gun action game inspired by 1930s cartoons. Featuring hand-drawn animation, watercolor backgrounds, and a jazzy soundtrack, it’s a nostalgic feast for the senses. You play as Cuphead or Mugman, battling creatively designed bosses across surreal worlds to repay a debt to the devil. The gameplay is tough but fair, demanding precision, timing, and pattern recognition. Each boss fight is a spectacle of chaos and charm, with unique mechanics and whimsical flair. Cuphead’s blend of retro aesthetics and hardcore challenge makes it a standout title that celebrates classic animation and old-school gaming difficulty.",
    "ratings": 9.1,
    "developer": "Studio MDHR"
  },
  {
    "id": 5,
    "title": "Enter the Gungeon",
    "coverPhoto": "https://i.ibb.co.com/Y7C9nfmL/Enter-Exit-the-Gungeon-Mobile-Key-Art.webp",
    "category": "Bullet Hell",
    "downloadLink": "https://store.steampowered.com/app/311690/Enter_the_Gungeon/",
    "description": "Enter the Gungeon is a chaotic bullet-hell dungeon crawler where gun-themed madness reigns supreme. You play as one of several quirky characters seeking a legendary gun that can kill the past. Each run features procedurally generated rooms, bizarre enemies, and hundreds of inventive weapons—from laser rifles to guns that shoot fish. Dodge-rolling through waves of bullets, unlocking secrets, and surviving boss fights are core to the experience. The game’s pixel art style, humor, and fast-paced action create a thrilling loop of discovery and destruction. With co-op mode and endless replayability, Enter the Gungeon is a wild ride through ballistic mayhem.",
    "ratings": 8.9,
    "developer": "Dodge Roll"
  },
  {
    "id": 6,
    "title": "Hotline Miami",
    "coverPhoto": "https://i.ibb.co.com/vvXCQx7g/hmfeatureed-e1666484434336.jpg",
    "category": "Action",
    "downloadLink": "https://store.steampowered.com/app/219150/Hotline_Miami/",
    "description": "Hotline Miami is a brutal top-down action game drenched in neon, blood, and synthwave. Set in an alternate 1980s Miami, you play as a masked vigilante receiving mysterious phone calls that send you on violent rampages. The gameplay is fast, unforgiving, and strategic—every room is a puzzle of timing and reflexes. One hit kills, so planning and execution are key. The game’s surreal narrative, psychedelic visuals, and pounding electronic soundtrack create a hypnotic, unsettling atmosphere. Hotline Miami is a cult classic that challenges players to embrace chaos, question morality, and lose themselves in a fever dream of violence and style.",
    "ratings": 9.0,
    "developer": "Dennaton Games"
  },
  {
    "id": 7,
    "title": "Risk of Rain 2",
    "coverPhoto": "https://i.ibb.co.com/YnfPBtc/risk-of-rain-2-heretic.jpg",
    "category": "Roguelike",
    "downloadLink": "https://store.steampowered.com/app/632360/Risk_of_Rain_2/",
    "description": "Risk of Rain 2 transforms the original’s 2D roguelike formula into a fully 3D third-person shooter. You battle through alien landscapes, facing hordes of enemies and collecting powerful items that stack and synergize in wild ways. The longer you survive, the harder the game becomes, creating a tense race against time. Play solo or with friends, choosing from diverse characters with unique abilities. Each run is different, offering new strategies and surprises. With vibrant visuals, dynamic music, and deep replayability, Risk of Rain 2 delivers chaotic fun and strategic depth, making it a standout in the roguelike genre.",
    "ratings": 9.0,
    "developer": "Hopoo Games"
  },
  {
    "id": 8,
    "title": "The Binding of Isaac: Rebirth",
    "coverPhoto": "https://i.ibb.co.com/8nwsDTct/54d7748b998eb250b6a2746d1d1ebe52976953b4056a8c1a2e3a99ababf2dc6a.jpg",
    "category": "Action",
    "downloadLink": "https://store.steampowered.com/app/250900/The_Binding_of_Isaac_Rebirth/",
    "description": "The Binding of Isaac: Rebirth is a dark, twisted roguelike dungeon crawler where you play as Isaac, a boy escaping his mother’s wrath by descending into a monster-filled basement. Each run features randomly generated levels, grotesque enemies, and hundreds of bizarre items that alter gameplay. The game’s themes of religion, trauma, and transformation are explored through disturbing visuals and cryptic storytelling. With multiple endings, unlockable characters, and endless item combinations, Rebirth offers immense replayability. Its blend of horror, humor, and deep mechanics has made it a genre-defining title that challenges players to embrace the weird and master the unpredictable.",
    "ratings": 9.1,
    "developer": "Nicalis / Edmund McMillen"
  },
  {
    "id": 9,
    "title": "Furi",
    "coverPhoto": "https://i.ibb.co.com/s9KFMBSp/uNKeq7.jpg",
    "category": "Action",
    "downloadLink": "https://store.steampowered.com/app/423230/Furi/",
    "description": "Furi is a boss-rush action game that combines hack-and-slash combat with bullet-hell intensity. You play as a mysterious prisoner fighting through a series of guardians to earn your freedom. Each boss is a unique challenge, requiring mastery of dodging, parrying, and timing. The game’s neon visuals, electronic soundtrack, and minimalist storytelling create a stylish, immersive experience. Furi demands precision and patience, rewarding players who learn patterns and adapt quickly. With tight controls and a focus on one-on-one duels, it’s a test of skill and endurance. Every fight feels personal, and every victory is earned through grit and determination.",
    "ratings": 8.7,
    "developer": "The Game Bakers"
  },
  {
    "id": 10,
    "title": "Hyper Light Drifter",
    "coverPhoto": "https://i.ibb.co.com/F4K56nzF/d0d2cfb4-654b-4569-94cd-9a6d055e4393.jpg",
    "category": "Action RPG",
    "downloadLink": "https://store.steampowered.com/app/257850/Hyper_Light_Drifter/",
    "description": "Hyper Light Drifter is a 2D action RPG set in a mysterious, decaying world filled with ancient technology and forgotten secrets. You play as a drifter suffering from a deadly illness, exploring ruins, battling enemies, and uncovering cryptic lore. The game features fast-paced combat, stunning pixel art, and a haunting soundtrack. With no dialogue, the story unfolds through visuals and atmosphere, inviting interpretation and emotional connection. Inspired by classic 8-bit and 16-bit games, Hyper Light Drifter blends nostalgia with modern design. It’s a poignant, challenging journey that resonates with players through its beauty, mystery, and elegant simplicity.",
    "ratings": 8.8,
    "developer": "Heart Machine"
  }
]
